foam-v2312/run/BodoiaOsterle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

#include "../parms"

vertices
(
    (0 -1 0)
    (1 -1 0)
    (0 0 0)
    (1 0 0)
    (0 5 0)
    (1 5 0)
    (0 -1 1) //6
    (1 -1 1)
    (0 0 1)
    (1 0 1)
    (0 5 1)
    (1 5 1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (10 10 10) simpleGrading (1 1 1)
    hex (2 3 5 4 8 9 11 10) (10 50 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 7 6)
        );
    }
	
    top
    {
        type patch;
        faces
        (
            (4 5 11 10)
        );
    }
	
    walls
    {
        type wall;
        faces
        (
            (4 2 8 10)
            (3 5 11 9)
        );
    }
    unheatedWall
    {
        type patch;
        faces
        (
            (0 2 8 6)
            (1 3 9 7)
        );
    }
);

// ************************************************************************* //