foam-v2312/run/BodoiaOsterle/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parms"

dimensions      [0 0 0 1 0 0 0];

internalField uniform $TRef;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      uniform $Tw;
    }

    bottom
    {
        type            fixedValue;
        value           uniform $TRef;
    }

    walls
    {
        type            fixedValue;
        value           uniform $Tw;
    }

    unheatedWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
